Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm Properties
The ReinforcementSelectionForm type exposes the following members.
Properties
Name | Description
Culture
 Gets the culture.
SelectedBendingRadius
 Gets the selected rebar bending radius.
SelectedGrade
 Gets the selected rebar grade.
SelectedSize
 Gets the selected rebar size.
SelectedUsage
 Gets the selected usage.
Top
See Also
Reference
ReinforcementSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace